app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 0 LIMIT 1
---
  def show
    @user = User.find params[:id]

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def edit
    @user = User.find params[:id]

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `firstname` = 'Vova1', `updated_at` = '2013-01-02 12:42:42' WHERE `users`.`id` = 1
---
  def update
    @user = User.find params[:id]
    if @user.update_attributes params[:user]

INSERT INTO `users` (`created_at`, `email`, `firstname`, `lastname`, `updated_at`) VALUES ('2013-01-02 13:11:55', '', '', '', '2013-01-02 13:11:55')
---
  def create
    @user = User.new params[:user]
    if @user
      @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 3
---
  def destroy
    @user = User.find params[:id]
    if @user
      @user.delete